[LANG]
language=Slovak (Slovensko)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=Chyba syntaxe SQL
200002=Súbor neexistuje
200003=Súbor je poškodený
200004=Chyba parametra
200026=Názov tabuľky už existuje
200027=Názov tabuľky neexistuje
200028=Chyba importu CSV súboru, nepodarilo sa vygenerovať SQL, skontrolujte obsah CSV súboru a konfiguráciu
300001=Nie je vybratý stĺpec tabuľky na vytvorenie indexu
300002=Príkaz SQL nemôže byť prázdny
300003=Analýza SQL podporuje iba SELECT dopyty
[STRING]
home=Domov
database=Databáza
analysis=Analýza
view=Pohľad
setting=Nastavenia
items=záznamov
tables=Tabuľky
views=Pohľady
triggers=Triggre
columns=Stĺpce
indexes=Indexy
table=Tabuľka
clear-all=Vymazať všetko
yes=Áno
no=Nie
welcome-text=Vitajte v CuteSqlite
home-text1=CuteSqlite je grafický klientsky nástroj (GUI) pre Sqlite3.
home-text2=Umožňuje navrhovať, vytvárať a prezerať databázy, spravovať databázové objekty,
home-text3=vkladať údaje a tiež navrhovať a spúšťať SQL dopyty na spracovanie uložených údajov.
home-text4=Môžete tiež migrovať databázu a údaje od iných dodávateľov databáz do databázy Sqlite.
db-section-text=Databáza Sqlite
analysis-text1=CuteSqlite umožňuje analyzovať a optimalizovať výkon príkazov SQL.
analysis-text2=A tiež umožňuje analyzovať kapacitu úložiska každej tabuľky v databáze,
analysis-text3=ako aj konfigurovať parametre databázy na jej optimalizáciu.
perf-analysis-section-text=Analýza výkonu
error-text=Systémová chyba:
create-database=Vytvoriť novú databázu (Ctrl+N)
open-database=Otvoriť databázu (Ctrl+O)
refresh-database=Obnoviť databázu (F5)
delete-database=Odstrániť vybranú databázu zo zoznamu (Del)
override-user-db=Údaje odstráneného súboru nie je možné obnoviť. Potvrdiť prepísanie databázy?
create-db-success-text=Databáza bola úspešne vytvorená
open-db-exists-inlist=Databáza je už otvorená, neopakujte operáciu
open-db-success-text=Databáza bola úspešne otvorená
delete-user-db=Potvrdiť odstránenie databázy "{dbName}" zo zoznamu?
delete-db-success-text=Databáza bola úspešne odstránená zo zoznamu
query-editor=Editor dopytov
history=História
history-tip=História (F8)
result-list=Výsledky
result-info=Informácie
result-table-data=Údaje tabuľky
table-properties=Vlastnosti tabuľky
exec-select-sql=Spustiť vybraný dopyt (F9)
exec-all-sql=Spustiť všetky dopyty (F10)
explain-select-sql=Vysvetliť (Explain) vybraný príkaz SQL (F11)
explain-query-plan-sql=Vysvetliť plán dopytu (Explain query plan) vybraného príkazu SQL (F12)
query-page-help=Funkcia automatického dopĺňania: [Tab] -> ďalšia karta; [Ctrl+Medzerník] -> zobraziť zhody; [Ctrl+Enter] -> zobraziť všetky značky
no-select-userdb=Nie je vybratá žiadna databáza
no-sql-statement=Editor dopytov neobsahuje žiadny príkaz SQL
no-sql-content=Editor dopytov neobsahuje žiadny obsah SQL
show-form-view=Zobraziť formulárový pohľad
export-result-as=Exportovať ako... (Ctrl+Alt+E)
copy-result-data=Kopírovať údaje do schránky
clear-all=Vymazať všetko
ok=OK
cancel=Zrušiť
export-text-description=Vyberte formát na export údajov
csv-settings=Možnosti CSV
csv-field-settings=Stĺpce
csv-line-settings=Riadky
csv-charset-settings=Znaková sada
excel-settings=Možnosti Excelu
sql-settings=Možnosti SQL
export-fields-settings=Vyberte stĺpce na export
terminated-by=Oddeľovač
enclosed-by=Ohraničovač
escaped-by=Escape znak
field-terminated-by=Oddeľovač stĺpcov
field-enclosed-by=Ohraničovač stĺpcov
field-escaped-by=Escape znak stĺpcov
line-terminated-by=Oddeľovač riadkov
add-column-name=Pridať názvy stĺpcov do hlavičky
csv-charset=Znaková sada
excel-column-max-size=Obmedzenie veľkosti textového stĺpca
excel-decinmal-places=Desatinné miesta
structure-only=Iba štruktúra
data-only=Iba údaje
structure-and-data=Štruktúra a údaje
select-all=Vybrať všetko
deselect-all=Zrušiť výber všetkého
save-to-file=Uložiť do súboru
expert-fmt-error=Prosím, vyberte formát súboru na export údajov
terminated-by-error=Prosím, zadajte hodnotu pre "Oddeľovač"
enclosed-by-error=Prosím, zadajte hodnotu pre "Ohraničovač"
escaped-by-error=Prosím, zadajte hodnotu pre "Escape znak"
line-terminated-by-error=Hodnota "Oddeľovač riadkov" je nesprávna
excel-column-max-size-error=Prosím, zadajte hodnotu pre "Obmedzenie veľkosti textového stĺpca"
excel-decinmal-places-error=Prosím, zadajte hodnotu pre "Desatinné miesta"
export-sql-error=Prosím, vyberte možnosti SQL
selected-fields-error=Prosím, vyberte stĺpce na export
export-path-error=Prosím, zadajte cestu k exportnému súboru
sql-notsupport-multitable-query-error=Export výsledkov z dopytov cez viac tabuliek a poddotazov nie je podporovaný
export-success-text=Export úspešný, bolo exportovaných {rows} riadkov údajov. Otvoriť súbor?
open-the-file=Otvoriť súbor
export-file-exists-prompt={export-path} už existuje. Nahradiť?
limit-rows=Obmedzenie riadkov
offset=Počiatočný riadok
rows=Počet riadkov
copy-all-rows-to-clipboard=Kopírovať všetky riadky do schránky Ctrl+Alt+A
copy-sel-rows-to-clipboard=Kopírovať vybrané riadky do schránky Ctrl+Alt+H
copy-all-rows-as-sql=Kopírovať všetky riadky ako SQL Ctrl+Alt+J
copy-sel-rows-as-sql=Kopírovať vybrané riadky ako SQL Ctrl+Alt+K
read-only=Iba na čítanie
filter=Filter (Ctrl+Alt+F)
filter-in-use=Filter sa používa
refresh=Obnoviť (Ctrl+F5)
refresh-page=Obnoviť
new-row-tip=Nový riadok (Ctrl+Alt+N)
copy-row-tip=Kopírovať riadok (Ctrl+Alt+C)
save-tip=Uložiť (Ctrl+Alt+S)
delete-tip=Odstrániť vybraný riadok (Ctrl+Del)
cancel-tip=Späť zmeny (Ctrl+Alt+Z)
revert-tip=Obnoviť
save=Uložiť
revert=Späť zmeny
column=Názov stĺpca
condition=Podmienka
value=Hodnota
delete-confirm-text=Potvrdiť odstránenie vybraných riadkov?
query=Dopyt
result=Výsledok
affected-rows=Ovplyvnené riadky
exec-time=Čas vykonania
transfer-time=Čas prenosu
total-time=Celkový čas
database-create=Vytvoriť DB Ctrl+N
database-open=Otvoriť DB Ctrl+O
database-refresh=Obnoviť DB Ctrl+R
database-delete=Odstrániť DB Del
database-copy=Kopírovať DB ako... Ctrl+P
database-export-as-sql=Exportovať DB do SQL Ctrl+E
database-import-from-sql=Importovať SQL do DB Ctrl+I
database-new=Vytvoriť
database-new-table=Tabuľku
database-new-view=Pohľad
database-new-trigger=Trigger
export-as-sql-text-description=Exportovať vybrané tabuľky/pohľady/triggre DB ako SQL
select-database=Vybraná databáza
database-objects=Objekty
structure-and-data-settings=Nastavenia štruktúry a údajov
insert-statement-settings=Nastavenia príkazu INSERT
tbl-statement-settings=Nastavenia príkazov tabuľky
retain-column-text=Zachovať názvy stĺpcov v "Insert Into"
contain-multi-rows-text=Každý príkaz "Insert" obsahuje viacero riadkov (VALUES)
retain-table-text=Zachovať starú tabuľku (Create Table If Not Exists ...)
override-table-text=Prepísať starú tabuľku (DROP TABLE, potom CREATE TABLE)
import-from-sql-text-description=Dávkové vykonanie príkazov v súbore SQL.
abort-on-error-text=Zastaviť pri chybe.
import-file-not-exists=Importovaný súbor SQL neexistuje, vyberte znova.
import-path-empty-error=Cesta k importnému súboru nemôže byť prázdna.
import=Importovať
export=Exportovať
tbl-name=Názov tabuľky
new-table=Vytvoriť tabuľku
new-view=Vytvoriť pohľad
new-trigger=Vytvoriť trigger
database=Databáza
schema=Schéma
table-columns=Stĺpce
table-indexes=Indexy
table-foreignkeys=Cudzie kľúče
column-name=Názov stĺpca
data-type=Typ údajov
default=Predvolené
check=Kontrola
index-name=Názov indexu
index-type=Typ indexu
index-unique=Unikátny
partial-clause=Čiastočná klauzula
comments=Komentáre
to-be-selected=Dostupné stĺpce
selected=Vybrané
up=▲
down=▼
no-columns-selected=Nie je vybratý žiadny stĺpec, prosím vyberte
sql-preview=Náhľad SQL
tbl-name-empty=Názov tabuľky nemôže byť prázdny
tbl-name-duplicated=Názov tabuľky už existuje
create-table-success-text=Tabuľka bola úspešne vytvorená.
alter-table-success-text=Tabuľka bola úspešne zmenená.
rename-table-success-text=Názov tabuľky bol úspešne zmenený.
delete-column-confirm-text=Vybraný stĺpec je referencovaný jedným alebo viacerými indexmi. Odstránenie tohto stĺpca tiež zmení zodpovedajúce indexy. Potvrdiť odstránenie?
delete-index-confirm-text=Vybraný index je referencovaný jedným alebo viacerými stĺpcami. Odstránenie tohto indexu tiež zmení zodpovedajúce stĺpce. Potvrdiť odstránenie?
delete-confirm-text=Potvrdiť odstránenie?
new-view=Vytvoriť pohľad
new-trigger=Vytvoriť trigger
create-a-view-name=Názov nového pohľadu
view-name-not-empty=Názov nového pohľadu nemôže byť prázdny
view-name-duplicated=Názov pohľadu už existuje
create-a-trigger-name=Názov triggeru
trigger-name-not-empty=Názov triggeru nemôže byť prázdny
trigger-name-duplicated=Názov triggeru už existuje
execute-sql-success=SQL bolo úspešne vykonané
copy-db-success-text=Databáza bola úspešne skopírovaná
table-open=Otvoriť údaje tabuľky Alt+O
table-create=Vytvoriť tabuľku Alt+N
table-alter=Zmeniť tabuľku Alt+A
table-rename=Premenovať tabuľku Alt+M
table-truncate=Vyprázdniť tabuľku Alt+T
table-drop=Odstrániť tabuľku Alt+Del
table-copy-as=Kopírovať tabuľku do... Alt+P
table-sharding-as=Sharding Alt+G
table-export=Exportovať tabuľku do... Alt+E
table-import-sql=Importovať zo súboru SQL Alt+I
table-import-csv=Importovať zo súboru CSV Alt+J
table-manage-index=Spravovať indexy tabuľky
table-manage-foreign-key=Spravovať cudzie kľúče tabuľky
properties=Vlastnosti
primary-key-duplicated=Primárny kľúč je definovaný viackrát.
foreignkey-name=Názov cudzieho kľúča
referencing-columns=Stĺpce tejto tabuľky
referenced-table=Referencovaná tabuľka
referenced-columns=Referencované stĺpce
on-update=Po aktualizácii
on-delete=Po odstránení
insert-new-column=Pridať nový stĺpec
insert-new-index=Pridať nový index
insert-new-foreignkey=Pridať nový cudzí kľúč
insert-del-column=Odstrániť vybraný stĺpec
insert-del-index=Odstrániť vybraný index
insert-del-foreignkey=Odstrániť vybraný cudzí kľúč
select-referenced-table-first=Najprv vyberte referencovanú tabuľku
new-table-name=Nový názov tabuľky
table-name-not-empty=Nový názov tabuľky nemôže byť prázdny
table-name-duplicated=Nový názov tabuľky už existuje
ai-column-exists=Stĺpec AUTOINCREMENT už existuje.
ai-fobidden-multi-pk=Stĺpec AUTOINCREMENT už existuje, viacero stĺpcov primárneho kľúča nie je povolených.
ai-column-must-integer=Stĺpec AUTOINCREMENT musí byť typu INTEGER.
truncate-table-confirm-text=Po vyprázdnení tabuľky nie je možné údaje obnoviť. Potvrdiť vyprázdnenie?
truncate-table-success-text=Údaje tabuľky boli úspešne vyprázdnené
drop-table-confirm-text=Po odstránení tabuľky nie je možné údaje obnoviť. Potvrdiť odstránenie?
drop-table-success-text=Tabuľka bola úspešne odstránená
copy-table-text-description=Konfigurácia parametrov kopírovania, podporuje sharding tabuliek
from-db-name=Zdrojová DB
from-tbl-name=Zdrojová tabuľka
to-db-name=Cieľová DB
to-tbl-name=Cieľová tabuľka
table-sharding-setttings=Sharding tabuľky
enable-table-sharding=Povoliť sharding tabuľky
table-suffix-begin={suffix} Počiatočné celé číslo
table-suffix-end={suffix} Koncové celé číslo
advanced-settings=Pokročilé možnosti shardingu
enable-copy-data-with-strategy=Povoliť stratégiu kopírovania údajov do shardovaných tabuliek
sharding-strategy-express-text=Výraz stratégie shardingu: {n}
preview-sql=Náhľad príkazu SQL
structure-and-data-settings-unknown=Nastavenia štruktúry a údajov neboli vybraté
table-suffix-error=Neplatné celé číslo pre sharding, zadajte správnu hodnotu
target-table-name-no-n=Cieľová tabuľka musí obsahovať reťazec "{n}".
sharding-strategy-express-empty=Výraz stratégie shardingu nemôže byť prázdny
copy-table-success-text=Tabuľka bola úspešne skopírovaná.
start=Spustiť
complete=Dokončené
express-title=Výraz stratégie shardingu tabuľky
functions=Funkcie
express-editor-help=Výraz - dvakrát kliknite na funkciu alebo pole pre vloženie do editora
import-from-csv-text-description=Konfigurácia pre import údajov zo súboru CSV
source-csv-file=Cesta k zdrojovému súboru CSV
target-database=Cieľová databáza
target-table=Cieľová tabuľka
columns-setttings=Stĺpce
csv-data=Údaje CSV
column-name-on-top=Prvý riadok ako názvy stĺpcov
line-terminated-by=Oddeľovač riadkov
csv-null-as-keyword=null/NULL ako kľúčové slovo SQL
encoding=Znaková sada
import-success-text=Import úspešný
incorrect-sql-statement=Nesprávny príkaz SQL
import-error-text=Chyba importu
table-manage-columns=Spravovať stĺpce
table-drop-column=Odstrániť stĺpec
table-manage-indexes=Spravovať indexy
table-drop-index=Odstrániť index
create-view=Vytvoriť nový pohľad
open-view=Otvoriť pohľad
drop-view=Odstrániť pohľad
create-trigger=Vytvoriť trigger
open-trigger=Otvoriť trigger
drop-trigger=Odstrániť trigger
drop-view-confirm-text=Po odstránení pohľadu ho nie je možné obnoviť. Potvrdiť odstránenie?
drop-view-success-text=Pohľad bol úspešne odstránený
drop-trigger-confirm-text=Po odstránení triggeru ho nie je možné obnoviť. Potvrdiť odstránenie?
drop-trigger-success-text=Trigger bol úspešne odstránený
sql-templates=Šablóny príkazov SQL
pragma-templates=Pragmas
sql-log=História SQL
clear-all=Vymazať všetko
use=Použiť
explain=Vysvetliť
top=Pripnúť
untop=Odopnúť
copy=Kopírovať
delete=Odstrániť
today=Dnes
yestoday=Včera
delete-sql-log-confirm-text=Naozaj chcete odstrániť históriu SQL?
copy-to-clipboard=Skopírované do schránky
save-success-text=Uloženie úspešné
delete-success-text=Odstránenie úspešné
data-has-changed=Údaje boli zmenené. Naozaj chcete zavrieť stránku?
not-save-and-close=Neukladať, zavrieť
cancel=Zrušiť zatvorenie
table-export-as=Exportovať tabuľku Alt+E
export-as-sql-success-text=Export úspešný. Otvoriť súbor?
new-query=Nové okno dopytu (F7)
save-current=Uložiť aktuálne (Ctrl+S)
save-all=Uložiť všetko (Ctrl+Shift+S)
first-page=Prvá strana
prev-page=Predchádzajúca strana
next-page=Ďalšia strana
last-page=Posledná strana
save-if-data-has-changed=Údaje boli zmenené. Uložiť pred zatvorením?
unsort=Späť triedenie
tab-close-this=Zavrieť túto
tab-close-others=Zavrieť ostatné
tab-close-left=Zavrieť všetky vľavo
tab-close-right=Zavrieť všetky vpravo
perf-analysis=Analýza výkonu
perf-analysis-reports=Reporty z analýzy
store-analysis=Analýza úložiska
db-params=Parametre DB
not-select-sql=Podporované sú iba SELECT príkazy
open-sql-log=Otvoriť históriu SQL pre analýzu výkonu (Ctrl+L)
add-sql-analysis=Zadajte príkaz SQL pre analýzu výkonu (Ctrl+I)
sql-log-not-found=História SQL sa nenašla, skontrolujte, či nebola odstránená
original-sql=Pôvodný príkaz SQL
where-clause-analysis=Analýza klauzuly WHERE
order-clause-analysis=Analýza klauzuly ORDER
covering-index-analysis=Analýza pokrývajúcich indexov
table-join-analysis=Analýza JOIN
in-table=Tabuľka údajov
where-use-column=Klauzula WHERE používa stĺpce
order-use-column=Klauzula ORDER používa stĺpce
covering-index-column=Klauzuly WHERE a ORDER používajú stĺpce
where-use-index=Klauzula WHERE používa index
order-use-index=Klauzula ORDER používa index
use-covering-index=Používa pokrývajúci index
create-index-for-performance=Odporúčanie: vytvorte index pre nasledujúce stĺpce na zlepšenie výkonu dopytov
hint-index-for-performance=Tip: index {hintIndexName} už pokrýva stĺpce: {hintIndexColumns}
create-covering-index-for-performance=Odporúčanie: vytvorte pokrývajúci index pre nasledujúce stĺpce na zlepšenie výkonu dopytov
create-index-togeger=Vytvoriť index (spoločne)
create-index-individ=Vytvoriť indexy (samostatne)
create-covering-index=Vytvoriť pokrývajúci index
explain-query-plan=Vysvetliť plán dopytu
query-optimizer-pseudocode=Nasledujúci pseudokód zobrazuje proces vykonávania optimalizátora dopytov
cycle-count=Štatistiky cyklov
optimize-cycle-count=Tip: zmena poradia spojenia tabuliek JOIN môže optimalizovať a znížiť počet cyklov.
general-settings=Všeobecné nastavenia
about=O aplikácii
language-setting=Nastavenie jazyka rozhrania
change-language-restart-text=Pre zmenu jazyka je potrebné reštartovať softvér.
close-and-restart=Zavrieť a reštartovať
do-not-restart=Nereštartovať
about-us=O nás
about-us-description=CuteSqlite je open-source softvér vyvinutý autorom Xuehan Qin.
version-info=Verzia
version-info-description=CuteSqlite v0.2.2 beta (64-bitová)
feedback=Spätná väzba
feedback-description=Ak máte problémy so softvérom, alebo máte nápady a návrhy pre túto aplikáciu, vyplňte prosím nasledujúci formulár a pošlite nám spätnú väzbu.
content-text=Obsah
license=Licencia Apache verzia 2.0
select-columns-analysis=Analýza stĺpcov SELECT
select-use-column=Príkaz SELECT používa nasledujúce stĺpce
select-use-column-count=Počet stĺpcov
select-use-column-advice=Odporúčanie: príkaz SELECT vyberá viac ako {maxColumns} stĺpcov. Zníženie počtu stĺpcov môže zlepšiť výkon dopytov.
select-use-column-tips=Tip: zníženie počtu stĺpcov môže zlepšiť výkon dopytov.
sql-perf-report-prefix=report-výkonu-sql-
store-analysis-prefix=Analýza úložiska:
analysis-sql=Analýza SQL
open-perf-report=Otvoriť report Alt+O
drop-perf-report=Odstrániť report Alt+Del
drop-perf-report-confirm-text=Potvrdiť odstránenie reportu?
store-analysis-text=Umožňuje analyzovať kapacitu úložiska databázy, tabuliek a indexov
table-store-analysis=Tabuľka - {tblName}
index-store-analysis=Index - {idxName} - Tabuľka: {tblName}
db-disk-used-title=Report o využití miesta na disku, cesta k DB: {dbPath}
page-size-text=Veľkosť stránky (v bajtoch)
page-size-tips=Veľkosť stránky (v bajtoch)
file-bytes-text=Veľkosť súboru (v bajtoch)
file-bytes-tips=Veľkosť súboru (v bajtoch)
file-pgcnt-text=Počet stránok v celom súbore (nameraný)
file-pgcnt-tips=Počet stránok v celom súbore (nameraný)
file-pgcnt2-text=Počet stránok v celom súbore (vypočítaný)
file-pgcnt2-tips=Počet stránok v celom súbore (vypočítaný)
inuse-pgcnt-text=Počet stránok ukladajúcich údaje (používaných)
inuse-pgcnt-tips=Počet stránok ukladajúcich údaje (používaných)
free-pgcnt2-text=Počet stránok bez údajov (podľa hlavičky)
free-pgcnt2-tips=Počet stránok bez údajov (podľa hlavičky)
free-pgcnt-text=Počet stránok bez údajov (vypočítaný)
free-pgcnt-tips=Počet stránok bez údajov (vypočítaný)
av-pgcnt-text=Počet automaticky vyprázdnených stránok
av-pgcnt-tips=Počet automaticky vyprázdnených stránok
ntable-text=Počet tabuliek v DB
ntable-tips=Počet tabuliek v DB
nindex-text=Počet indexov
nindex-tips=Počet indexov
nmanindex-text=Počet definovaných indexov
nmanindex-tips=Počet definovaných indexov
nautoindex-text=Počet implicitných indexov (auto-inkrement)
nautoindex-tips=Počet implicitných indexov (auto-inkrement)
user-payload-text=Bajtov uloženého užitočného zaťaženia používateľa
user-payload-tips=Bajtov uloženého užitočného zaťaženia používateľa
all-tbl-entrycnt-title=Celkové údaje všetkých tabuliek (počet záznamov)
all-tbl-idx-pagecnt-title=Počet stránok všetkých tabuliek a ich indexov
sperate-tbl-idx-pagecnt-title=Stránky všetkých tabuliek a indexov počítané samostatne
all-tbl-idx-report-title=Všetky tabuľky a indexy
total-pages-percent-text=Percento z celkového počtu stránok DB
total-pages-percent-tips=Percento z celkového počtu stránok DB
nentry-text=Množstvo údajov (počet záznamov)
nentry-tips=Množstvo údajov (počet záznamov)
storage-text=Využitý objem pamäte (v bajtoch)
storage-tips=Využitý objem pamäte (v bajtoch)
compressed-size-text=Využitý objem po kompresii (v bajtoch)
compressed-size-tips=Využitý objem po kompresii (v bajtoch)
payload-text=Objem užitočného zaťaženia (v bajtoch)
payload-tips=Objem užitočného zaťaženia (v bajtoch)
total-meta-text=Objem metadát (v bajtoch)
total-meta-tips=Objem metadát (v bajtoch)
depth-text=Hĺbka B-stromu
depth-tips=Hĺbka B-stromu
avg-payload-text=Priemerné užitočné zaťaženie na záznam
avg-payload-tips=Priemerné užitočné zaťaženie na záznam
avg-unused-text=Priemerný počet nevyužitých bajtov na záznam
avg-unused-tips=Priemerný počet nevyužitých bajtov na záznam
avg-meta-text=Priemerné metadáta na záznam
avg-meta-tips=Priemerné metadáta na záznam
avg-fanout-text=Priemerný faktor vetvenia
avg-fanout-tips=Priemerný faktor vetvenia
gap-cnt-text=Nesúvislé stránky
gap-cnt-tips=Nesúvislé stránky
mx-payload-text=Maximálne užitočné zaťaženie na záznam
mx-payload-tips=Maximálne užitočné zaťaženie na záznam
ovfl-cnt-text=Počet použitých pretečených záznamov
ovfl-cnt-tips=Počet použitých pretečených záznamov
int-pages-text=Počet použitých stránok indexov
int-pages-tips=Počet použitých stránok indexov
leaf-pages-text=Počet použitých listových stránok
leaf-pages-tips=Počet použitých listových stránok
ovfl-pages-text=Počet použitých stránok pretečenia
ovfl-pages-tips=Počet použitých stránok pretečenia
total-pages-text=Celkový počet použitých stránok
total-pages-tips=Celkový počet použitých stránok
int-unused-text=Nevyužité bajty na stránkach indexov
int-unused-tips=Nevyužité bajty na stránkach indexov
leaf-unused-text=Nevyužité bajty na listových stránkach
leaf-unused-tips=Nevyužité bajty na listových stránkach
ovfl-unused-text=Nevyužité bajty na stránkach pretečenia
ovfl-unused-tips=Nevyužité bajty na stránkach pretečenia
total-unused-text=Nevyužité bajty na všetkých stránkach
total-unused-tips=Nevyužité bajty na všetkých stránkach
all-table-report-title=Všetky tabuľky (bez indexov)
all-indices-report-title=Všetky indexy (bez tabuliek)
tbl-and-all-idx-report-title=Tabuľka {tblName} a všetky jej indexy
tbl-only-report-title=Tabuľka {tblName} (bez indexov)
idx-only-report-title=Všetky indexy tabuľky {tblName}
tbl-report-title=Tabuľka {tblName}
idx-report-title=Index {idxName} tabuľky {tblName}
props-tbl-only-report-title=Analýza úložiska tabuľky {tblName}
props-idx-props-only-report-title=Všetky indexy tabuľky {tblName}
db-pragma-params=Parametre PRAGMA
db-quick-config-params=Rýchle nastavenia
select-pragma=PRAGMA
pragma-analysis-limit-tips=Dotaz alebo zmena obmedzení pre nastavenia analýzy (ANALYZE). Toto je približný počet riadkov, ktorý príkaz ANALYZE kontroluje v každom indexe.
pragma-application-id-tips=Používa sa na dotaz alebo nastavenie 32-bitového celého čísla so znamienkom "Application ID" v poradí big-endian umiestneného na offsete 68 v hlavičke databázy.
pragma-auto-vacuum-tips=Dotaz alebo nastavenie stavu automatického vyprazdňovania (auto-vacuum) v databáze.
pragma-automatic-index-tips=Dotaz, zapnutie alebo vypnutie funkcie automatického indexovania.
pragma-busy-timeout-tips=Dotaz alebo zmena nastavenia časového limitu pri zaneprázdnení (busy timeout).
pragma-cache-size-tips=Dotaz alebo zmena maximálneho počtu stránok databázy na disku, ktoré SQLite odporúča uchovávať v pamäti pre každý otvorený súbor databázy.
pragma-cache-spill-tips=Zapnutie alebo vypnutie schopnosti stránkovacieho programu zapísať "špinavé" stránky vyrovnávacej pamäte do databázového súboru uprostred transakcie.
pragma-case-sensitive-like-tips=Predvolené správanie operátora LIKE ignoruje veľkosť písmen u ASCII znakov. Preto je v predvolenom nastavení 'a' LIKE 'A' pravdivé.
pragma-cell-size-check-tips=Zapnutie alebo vypnutie dodatočných kontrol integrity pri čítaní stránok B-stromu databázy z disku. Ak je kontrola veľkosti bunky zapnutá, poškodenie databázy môže byť odhalené skôr a je menej pravdepodobné, že sa "rozšíri".
pragma-checkpoint-fullfsync-tips=Dotaz alebo zmena príznaku fullfsync pre operácie kontrolných bodov (checkpoint). Ak je tento príznak nastavený, pri operáciách kontrolných bodov v systémoch podporujúcich F_FULLFSYNC sa použije metóda synchronizácie F_FULLFSYNC. Predvolená hodnota príznaku CHECKPOINT_FULLFSYNC je OFF. Iba Mac OS-X podporuje F_FULLFSYNC.
pragma-collation-list-tips=Vracia zoznam porovnávacích sekvencií (collation) definovaných pre aktuálne pripojenie k databáze.
pragma-compile-options-tips=Vracia názvy volieb použitých pri kompilácii SQLite, jednu voľbu na riadok.
pragma-count-changes-tips=Dotaz alebo zmena príznaku počítania zmien (count changes). Zvyčajne, keď nie je príznak count-changes nastavený, príkazy INSERT, UPDATE a DELETE nevracajú údaje.
pragma-data-store-directory-tips=Dotaz alebo zmena hodnoty globálnej premennej sqlite3_data_directory, ktorú používa backend rozhrania Windows na určenie umiestnenia súborov databázy zadaných relatívnou cestou.
pragma-data-version-tips=Indikuje, že databázový súbor bol zmenený. Interaktívne programy, ktoré uchovávajú obsah databázy v pamäti alebo ho zobrazujú na obrazovke, môžu použiť príkaz PRAGMA data_version na určenie, či potrebujú obnoviť a znovu načítať pamäť alebo aktualizovať zobrazenie na obrazovke.
pragma-default-cache-size-tips=Dotaz alebo nastavenie odporúčaného maximálneho počtu stránok diskovej vyrovnávacej pamäte, ktoré budú pridelené pre každý otvorený súbor databázy.
pragma-defer-foreign-keys-tips=Nariaďuje odložiť všetky obmedzenia cudzieho kľúča až do potvrdenia najvzdialenejšej transakcie.
pragma-empty-result-callbacks-tips=Dotaz alebo zmena príznaku spätného volania pre prázdny výsledok.
pragma-encoding-tips=Textové kódovanie používané hlavnou databázou: 'UTF-8', 'UTF-16le' (little-endian UTF-16) alebo 'UTF-16be' (big-endian UTF-16).
pragma-foreign-key-check-tips=Kontroluje databázu alebo tabuľku na porušenie obmedzení cudzieho kľúča.
pragma-foreign-keys-tips=Dotaz, zapnutie alebo vypnutie vynucovania obmedzení cudzieho kľúča.
pragma-freelist-count-tips=Vracia počet nepoužívaných stránok v databázovom súbore.
pragma-full-column-names-tips=Dotaz alebo zmena príznaku full_column_names.
pragma-fullfsync-tips=Dotaz alebo zmena príznaku fullfsync. Tento príznak určuje, či sa použije metóda synchronizácie F_FULLFSYNC v systémoch, ktoré ju podporujú. Predvolená hodnota fullfsync je OFF. Iba Mac OS X podporuje F_FULLFSYNC.
pragma-hard-heap-limit-tips=Nastavuje limit na množstvo haldy (heap) pre všetky pripojenia k databáze v jednom procese.
pragma-ignore-check-constraints-tips=Zapnutie alebo vypnutie vynucovania obmedzení CHECK. Predvolené nastavenie je OFF, čo znamená, že obmedzenia CHECK sú v predvolenom nastavení vynucované.
pragma-incremental-vacuum-tips=Spôsobí odstránenie až N stránok zo zoznamu voľných stránok (freelist).
pragma-integrity-check-tips=Vykonáva nízkourovňovú kontrolu formátovania a konzistencie databázy.
pragma-journal-mode-tips=Dotaz alebo nastavenie režimu denníka (journal mode) pre databázu priradenú k aktuálnemu pripojeniu.
pragma-journal-size-limit-tips=Obmedzuje veľkosť súborov spätného denníka (rollback journal) a WAL, ktoré zostávajú v súborovom systéme po transakcii alebo kontrolnom bode.
pragma-legacy-alter-table-tips=Nastavuje alebo dotazuje hodnotu príznaku legacy_alter_table.
pragma-locking-mode-tips=Nastavuje alebo dotazuje režim zamykania (locking mode) pripojenia k databáze. Režimy sú NORMAL alebo EXCLUSIVE.
pragma-max-page-count-tips=Dotaz alebo nastavenie maximálneho počtu stránok v databázovom súbore.
pragma-mmap-size-tips=Dotaz alebo zmena maximálneho počtu bajtov vyhradených pre I/O mapované do pamäte (memory-mapped I/O) pre jednu databázu.
pragma-module-list-tips=Vracia zoznam modulov virtuálnych tabuliek registrovaných u pripojenia k databáze.
pragma-optimize-tips=Pokúša sa optimalizovať databázu.
pragma-page-count-tips=Vracia celkový počet stránok v databázovom súbore.
pragma-page-size-tips=Dotaz alebo nastavenie veľkosti stránky databázy. Veľkosť stránky musí byť mocninou dvoch medzi 512 a 65536.
pragma-parser-trace-tips=Zapína trasovanie syntaktického analyzátora SQL používaného interne SQLite. Funguje iba pri kompilácii s SQLITE_DEBUG.
pragma-query-only-tips=Zabraňuje zmenám údajov v databázovom súbore. Ak je táto voľba zapnutá, akýkoľvek pokus o CREATE, UPDATE, DROP, INSERT alebo UPDATE povedie k chybe SQLITE_READONLY.
pragma-quick-check-tips=Vykonáva nízkourovňovú kontrolu formátovania a konzistencie databázy, pričom preskočí kontroly konzistencie UNIQUE a indexov.
pragma-read-uncommitted-tips=Dotaz, zapnutie alebo vypnutie úrovne izolácie READ UNCOMMITTED.
pragma-recursive-triggers-tips=Dotaz, zapnutie alebo vypnutie rekurzívneho vykonávania triggerov.
pragma-reverse-unordered-selects-tips=Ak je táto pragma zapnutá, mnoho SELECT dopytov bez ORDER BY bude vracať výsledky v opačnom poradí, než je obvyklé.
pragma-schema-version-tips=Získa alebo nastaví celé číslo schema_version na offsete 40 v hlavičke databázy.
pragma-secure-delete-tips=Dotaz alebo zmena nastavenia bezpečného mazania (secure-delete).
pragma-short-column-names-tips=Dotaz alebo zmena príznaku krátkych názvov stĺpcov.
pragma-soft-heap-limit-tips=Obmedzuje množstvo haldy používanej všetkými pripojeniami k databáze v jednom procese.
pragma-stats-tips=Vracia pomocné informácie o tabuľkách a indexoch.
pragma-synchronous-tips=Dotaz alebo zmena nastavenia príznaku "synchronous".
pragma-temp-store-tips=Dotaz alebo zmena hodnoty globálnej premennej sqlite3_temp_directory, ktorú používa mnoho backendov rozhrania OS na určenie umiestnenia na ukladanie dočasných tabuliek a indexov.
pragma-threads-tips=Počet pomocných vlákien spúšťaných pripraveným príkazom (prepared statement) na pomoc pri vykonávaní dopytu.
pragma-trusted-schema-tips=Určuje, či je povolené spúšťanie nebezpečných funkcií SQL a virtuálnych tabuliek v schéme. Určuje, či pohľady, triggre alebo výrazy schémy (napr. obmedzenia CHECK, klauzuly DEFAULT, generované stĺpce, indexy na výrazoch a/alebo čiastočné indexy) môžu spúšťať nebezpečné funkcie SQL a virtuálne tabuľky.
pragma-user-version-tips=Získa alebo nastaví celé číslo user_version na offsete 60 v hlavičke databázy.
pragma-vdbe-addoptrace-tips=Úplné operačné kódy VDBE sa zobrazia počas generovania kódu. Funguje, ak je SQLite skompilované s voľbou SQLITE_DEBUG a je zapnutý vdbe_debug.
pragma-vdbe-debug-tips=Zapína ladenie VDBE. Funguje, ak je SQLite skompilované s voľbou SQLITE_DEBUG.
pragma-vdbe-listing-tips=Vypíše úplný zoznam operačných kódov virtuálneho stroja na štandardný výstup. Funguje, ak je SQLite skompilované s voľbou SQLITE_DEBUG a je zapnutý vdbe_debug.
pragma-vdbe-trace-tips=Vypisuje operačné kódy virtuálneho stroja na štandardný výstup počas výpočtu. Funguje, ak je SQLite skompilované s voľbou SQLITE_DEBUG a je zapnutý vdbe_debug.
pragma-wal-autocheckpoint-tips=Dotaz alebo nastavenie intervalu automatického kontrolného bodu (auto-checkpoint) pre denník zápisu vopred (write-ahead log).
pragma-wal-checkpoint-tips=Spôsobí prenos obsahu denníka zápisu vopred (write-ahead log) pre databázu X v pripojení D do databázového súboru a resetovanie denníka zápisu vopred.
pragma-writable-schema-tips=Umožňuje meniť tabuľku sqlite_schema pomocou bežných príkazov UPDATE, INSERT a DELETE. Varovanie: zneužitie tejto pragmy môže ľahko viesť k poškodeniu databázového súboru.
pragma-save-confirm=Príkaz PRAGMA ovplyvní činnosť databázy. Potvrdiť vykonanie nasledujúceho príkazu?
confirm-exec-text=Potvrdiť a vykonať